Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetValidSurfaceCategoryIdsForReference(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.ElementId@)
The Mass surface subcategory ids that are appropriate values for the input Reference.
reference:
A Reference to a Face of this MassEnergyAnalyticalModel.
recommendedDefaultSubcategoryId:
The ElementId that is recommended as the default setting for this pick.
Returns:
Returns the ElementIds of appropriate values for input Reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of this MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetMassEnergyAnalyticalModelIdForMassInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ElementId of the MassEnergyAnalyticalModel for a mass instance.
document:
The Document.
massInstanceId:
ElementId of a mass instance.
Returns:
ElementId of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetMassSurfaceDataIdForReference(Autodesk.Revit.DB.Reference)
Get the ElementId of the MassSurfaceData corresponding to the Reference.
reference:
A Reference to a face of this MassEnergyAnalyticalModel.
Returns:
ElementId of a MassSurfaceData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of this MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetCoincidentMassZoneFaceReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Returns References to Faces from MassZones coincident with an input Face from a
MassEnergyAnalyticalModel.
Remarks:
The results are always References to Faces. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
document:
The Document.
referenceToFace:
A Reference to a Face of a MassEnergyAnalyticalModel.
Returns:
Returns References to Faces from MassZones coincident with an input Face from a
MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetCoincidentEnergyAnalyticalModelFaceReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Returns a Reference to a Face from the same or a different MassEnergyAnalyticalModel
that is coincident with the input Face.
Remarks:
The result is always a Reference to a Face. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
document:
The Document.
referenceToFace:
A Reference to a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012